WELCOME_MESSAGE = """Сәлем! 👋 Мен Izibot-пын, сенің жақсы көмекшіңмін 🤖
Бағдарлама туралы барлығын айтуға және кез-келген сұрақтарға жауап беруге дайынмын! 😊"""

LANGUAGE_SELECTION = "🌐 Тілді таңдаңыз:"

MAIN_MENU = "Әрекетті таңдаңыз:"

BACK_TO_MENU = "Сіз басты мәзірге оралдыңыз."

PROGRAM_INFO = """🌟 IZBASAR-Қазатомөнеркәсіптің жас мамандарға арналған бағдарламасы!    

🔹 **Бағдарлама не жайлы**  
Бағдарлама жоғары оқу орындарының түлектері мен компанияның жас қызметкерлерінің дамуы мен кәсіби өсуіне бағытталған 

🔄 **Бағдарлама қалай өтеді?**  
Қатысушылар Қазатомөнеркәсіп компаниялар ішінде ротациядан өтіп, жаңа дағдылар игеріп, озық тәжірибелергн ие болады

🎯 **Қандай бағыттар қарастырылған?**  
✅Уран өндіру  
✅ Геологиялық барлау  
✅ Ядролық отын циклі  
✅ IT және киберқауіпсіздік  
✅ Экология және қоршаған ортаны қорғау  
✅ HR және маркетинг  
✅ Экономика және қаржы

💰 **Тағылымдамада ай сайынғы жалақы қарастырылған"""

APPLICATION_RULES = """🌟 **IZBASAR бағдарламасы-жас мамандарға арналған бастама!

🔹 **Кім қатыса алады?**  
✅ Қазақстан Республикасының Азаматтары
✅ "Қазатомөнеркәсіп" ҰАК " АҚ қызметкерлері немесе жоғары оқу орындарының түлектері басым мамандықтар бойынша
✅ Географиялық ұтқырлық

🔄 **Бағдарлама қалай өтеді?**  
Қатысушылар Қазатомөнеркәсіп компанияларында **5 ай** бойы **3 ротациядан** өтеді, жаңа дағдыларды игереді және атом саласында тәжірибелі тәлімгерлердің жетекшілігімен дамиды, олар оқыту мен ротациялаудың барлық кезеңінде олармен бірге жүреді

📌 Толығырақ және сайтта өтініш беру:  
👉 [izbasar.kazatomprom.kz](https://izbasar.kazatomprom.kz/ru)"""

CONTACT_INFO = """Байланыс:
📞 Телефон: +7 (7xx) xxx-xx-xx
✉ Почта: izbasar@kazatomprom.kz
📸 Instagram: [@izbasarprogram](https://instagram.com/izbasarprogram)
🌐 Сайт: izbasar.kazatomprom.kz
📲 Бізге ыңғайлы түрде хабарласыңыз! 😊"""

FAQ_SELECTION = "Сұрақты таңдаңыз:"

FAQ = {
    "selection": "Сұрақты таңдаңыз:",
    "faq_what": """🏆 Конкурстық іріктеу 5 кезеңде өтеді:  
1️⃣ Бизнес-кейс шешу 📊   
2️⃣ Аналитикалық қабілеттерге арналған тесттер
3️⃣ Топтық жаттығу 🤝 
4️⃣ Құзыреттілік бойынша интервью 🎤    
5️⃣ Мотивациялық сауалнама және панельдік сұхбат 👥""",
    
    "faq_how_to_apply": """🚀 Izbasar - 2020 жылы құрылған Қазатомөнеркәсіптің жас мамандарын дамыту бағдарламасы.
Мақсаты - жас мамандарды кәсіби дамыту және уран саласы үшін кадрлық әлеуетті дамыту.""",
    
    "faq_requirements": """💰 Иә! Бағдарламаның финалистері:  
✅ Ай сайынғы жалақы 💵  
✅ Ротация орнына жол ақысын төлеу ️✈️🚆 ️ ️   
✅ Тұру ақысы төленеді 🏡""",
    
    "faq_final": """📍 Ротация Қазақстанның түрлі өңірлерінде өтеді:  
🏙 Астана, Алматы, Өскемен, Шымкент Қалалары  
🌍Облыс: Ақмола, Түркістан, Қызылорда"""
}