WELCOME_MESSAGE = """Привет! 👋 Я — Izibot, твой добрый помощник 🤖 
Готов рассказать всё о программе и ответить на любые вопросы! 😊"""

LANGUAGE_SELECTION = "🌐 Выберите язык:"

MAIN_MENU = "Выберите действие:"

BACK_TO_MENU = "Вы вернулись в главное меню."

PROGRAM_INFO = """🌟 IZBASAR – программа для молодых специалистов от Казатомпрома!  

🔹 **Что это?**  
Программа направлена на развитие и профессиональный рост выпускников вузов и молодых сотрудников компании

🔄 **Как проходит?**  
Участники проходят ротацию в группе компаний Казатомпром, осваивая новые навыки и перенимая передовые практики  

🎯 **Какие направления?**  
✅ Добыча урана  
✅ Геологоразведка  
✅ Ядерно-топливный цикл  
✅ IT и кибербезопасность  
✅ Экология и охрана окружающей среды  
✅ HR и маркетинг  
✅ Экономика и финансы  

💰 **Для участников стажировка оплачиваемая!**"""

APPLICATION_RULES = """🌟 **Программа IZBASAR** – старт для молодых специалистов!  

🔹 **Кто может участвовать?**  
✅ Граждане Республики Казахстан
✅ Сотрудники **АО «НАК «Казатомпром»** или выпускники вузов по приоритетным специальностям 
✅ Географическая мобильность

🔄 **Как проходит программа?**  
Участники проходят **3 ротации** по **5 месяцев** в группе компаний **Казатомпром**, осваивая новые навыки и развиваясь в атомной отрасли под руководством опытных наставников, которые сопровождают их на протяжении всего периода обучения и ротаций

📌 Подробности и подача заявки на сайте:  
👉 [izbasar.kazatomprom.kz](https://izbasar.kazatomprom.kz/ru)"""

CONTACT_INFO = """Наши контакты:
📞 Телефон: +7 (7xx) xxx-xx-xx
✉ Почта: izbasar@kazatomprom.kz
📸 Instagram: [@izbasarprogram](https://instagram.com/izbasarprogram)
🌐 Сайт: izbasar.kazatomprom.kz
📲 Свяжитесь с нами удобным способом! 😊"""

FAQ_SELECTION = "Выберите вопрос:"

FAQ = {
    "selection": "Выберите вопрос:",
    "faq_how_to_apply": """🏆 Конкурсный отбор проходит в 5 этапов:  
1️⃣ Решение бизнес-кейса 📊  
2️⃣ Тесты на аналитические способности  
3️⃣ Групповое упражнение 🤝  
4️⃣ Интервью по компетенциям 🎤  
5️⃣ Мотивационный опросник и панельное интервью 👥""",
    
    "faq_what": """🚀 Izbasar – программа развития молодых специалистов Казатомпрома, созданная в 2020 году.
Цель – профессиональное развитие молодых специалистов и развитие кадрового потенциала для урановой отрасли.""",
    
    "faq_requirements": """💰 Да! Финалисты программы получают: 
✅ Ежемесячную заработную плату 💵
✅ Оплату проезда на место ротации ✈️🚆
✅ Оплаченное проживание 🏡""",
    
    "faq_final": """📍 Ротация проходит в разных регионах Казахстана:  
🏙 Города: Астана, Алматы, Усть-Каменогорск, Шымкент  
🌍 Области: Акмолинская, Туркестанская, Кызылординская"""
}
